InformationRegisters/ПравилаРаботыСотрудниковКонтроль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПравилаРаботыСотрудниковКонтроль</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Распечатано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьПрочтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФункциональнаяРоль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПерсоналККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилаСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтправкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОтправкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыОтправкиУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПравилаРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПравилаРаботыСотрудников</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДинамическойЧасти</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧКартинки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧТекст</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФДХранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РолиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>РолиПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипРоли</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРолейПользователейМОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик_СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расчетчики</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРолиСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЛентыКартинок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставРоли</Name>
					<Comment>Сотрудники, входящие в роль в данной ИБ</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураХарактеристика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыРолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипРоли</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРолейПользователя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставТранспортРазвоз</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Откуда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куда</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыРозничныхТочек</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобытияАвторассылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СобытияАвторассылкиМОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РассылатьДочернимРолям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеРакурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ракурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МП_Ракурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПравилаРаботыСотрудниковКонтроль/Forms/ФормаУведомления/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПроверкаОткрытия") Тогда
		
		МассивПараметров = РегистрыСведений.ПравилаРаботыСотрудниковКонтроль.ПолучитьПараметрыОтображенияФормыКонтроля();
		
		Если МассивПараметров <> Неопределено Тогда
			СтруктураПараметров = МассивПараметров[0];
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
	Иначе
		
		СтруктураПараметров = Параметры;
		
	КонецЕсли;
	
	Если СтруктураПараметров = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Заполнение параметров формы
	СтруктураПараметров.Свойство("ДатаКонтроля", ДатаКонтроля);
	СтруктураПараметров.Свойство("ПравилаСсылка", СправочникСсылка);
	СтруктураПараметров.Свойство("СпособОтправки", СпособОтправки);
	СтруктураПараметров.Свойство("ОбъектКонтроля", ОбъектКонтроля);
	
	СтруктураПараметров.Свойство("Прочитано", Прочитано);
	СтруктураПараметров.Свойство("Распечатано", Распечатано);
	СтруктураПараметров.Свойство("КонтролироватьПечать", КонтролироватьПечать);
	СтруктураПараметров.Свойство("КонтролироватьПрочтение", КонтролироватьПрочтение);
	
	СтруктураПараметров.Свойство("ТекстСообщения", СообщениеПользователям);
	СтруктураПараметров.Свойство("Версия", ТекущаяВерсия);
	
	СтруктураПараметров.Свойство("ТекущийПродавец", ТекущийПродавец);
	
	Если НЕ ЗначениеЗаполнено(СправочникСсылка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Воссстановление текста HTML
	ВременныйКаталог = Справочники.ПравилаРаботыСотрудников.ПолучитьКаталогХраненияФайловКартинок(ТекущаяВерсия, ЭтаФорма.УникальныйИдентификатор);
	
	Попытка
		Справочники.ПравилаРаботыСотрудников.ВосстановитьКартинкиHTMLТекущейВерсии(СправочникСсылка, ТекущаяВерсия, ТекстHTML, ВременныйКаталог);
	Исключение //Если возникнет проблема с доступом к временному каталогу с кэшем HTML страницы (ограничение прав, проблемы сети и пр.)
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	УстановитьЗаголовокФормы();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПодтвердить(Команда)
	
	Если ПроверитьВыполнениеДействий() Тогда
		
		ПодтвердитьДействиеСервер();
		
		Этаформа.Закрыть();
		
	Иначе
		
		Сообщить(НСтр("ru = 'Выполните требуемые действия, и установите соответствующие отметки (рядом с кнопкой ""Подтвердить"")!';"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредпросмотр(Команда)
	
	ПредпросмотрHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	ПечатьHTML();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьВБраузере(Команда)
		
	Если НЕ ПустаяСтрока(ТекстHTML) Тогда 
		
		ИмяФайлаТекстHTML = ПолучитьИмяВременногоФайла(".html");
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
		
		ТекстовыйДокумент.Записать(ИмяФайлаТекстHTML);
		
		ЗапуститьПриложение(ИмяФайлаТекстHTML);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " (Версия: " + ТекущаяВерсия + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипДанныхСтроки()
	
	ТекущиеДанные = Элементы.СписокПолучателей.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
			ТекущиеДанные.Тип = ПредопределенноеЗначение("Перечисление.СпособыОтправкиУведомлений.Магазины");
			ТекущиеДанные.ФункциональнаяРоль = "Магазины";
		ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			ТекущиеДанные.Тип = ПредопределенноеЗначение("Перечисление.СпособыОтправкиУведомлений.Пользователи");
			ТекущиеДанные.ФункциональнаяРоль = ПолучитьФункциональнуюРольСотрудника(ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФункциональнуюРольСотрудника(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РолиПользователейСоставРоли.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|ГДЕ
		|	РолиПользователейСоставРоли.Сотрудник = &Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПредпросмотрHTML()
	
	Перем Документ;
	
	Документ = Элементы.ТекстHTML.Документ;
	
	sExpression = "
	|printPreview();
	|
	|function printPreview() {
	|	var yourDOCTYPE = ""<!DOCTYPE html>""; // your doctype declaration
	|	var printPreview = window.open('about:blank', 'print_preview', ""resizable=yes,scrollbars=yes,status=yes"");
	|	var printDocument = printPreview.document;
	|	printDocument.open();
	|	printDocument.write(yourDOCTYPE+
	|			   ""<html>""+
	|				   document.documentElement.innerHTML+
	|			   ""</html>"");
	|	printDocument.close();
	|}";
	
	Документ.parentWindow.execScript(sExpression);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьHTML()
	
	Перем Документ;
	
	Документ = Элементы.ТекстHTML.Документ;
	
	sExpression = "
	|CallPrint();
	|
	|function CallPrint() {
	|	var yourDOCTYPE = ""<!DOCTYPE html>""; // your doctype declaration
	|	var printDocument = window.open('', '', 'width=200,height=100');
	|	var printPreview = printDocument.document;
	|	printPreview.write(yourDOCTYPE+
	|			   ""<html>""+
	|				   document.documentElement.innerHTML+
	|			   ""</html>"");
	|	printPreview.close();
	|	printDocument.focus();
	|	printDocument.print();
	|	printDocument.close();
	|}";
	
	Документ.parentWindow.execScript(sExpression);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов();
	
	Элементы.Прочитано.Видимость   = КонтролироватьПрочтение;
	Элементы.Распечатано.Видимость = КонтролироватьПечать;
	
	Элементы.ДекорацияНадписьПодтверждение.Заголовок = "" + ПараметрыСеанса.ТекущийПользователь + ?(ЗначениеЗаполнено(ТекущийПродавец), " (" + ТекущийПродавец + ")", "");
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьДействиеСервер();
		
	РегистрыСведений.ПравилаРаботыСотрудниковКонтроль.ПодтвердитьЗаписьКонтроляПравилРаботы(Новый Структура("ДатаКонтроля, ПравилаСсылка, СпособОтправки, ОбъектКонтроля, Прочитано, Распечатано, ОтветственныйККМ", 
	           ДатаКонтроля, СправочникСсылка, СпособОтправки, ОбъектКонтроля, Прочитано, Распечатано, ТекущийПродавец));
			   
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВыполнениеДействий()
	
	//+++АК mika 2018.01.31 Без задачи. Замечено что некоторые магазины не отмечают флагами выполненное действие, а просто нажимают кнопку "подтвердить".
	Возврат (Элементы.Прочитано.Видимость И КонтролироватьПрочтение И Прочитано) 
		ИЛИ (Элементы.Распечатано.Видимость И КонтролироватьПечать И Распечатано);
	
КонецФункции

#КонецОбласти
